'''У четвертому модулі розв'язували завдання нормалізації даних. Розширмо її.

При аналізі даних часто виникає необхідність позбавитися екстремальних значень, перш ніж почати працювати з даними далі. 
Напишіть функцію data_preparation, яка приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

Функція повинна видаляти з переданих списків найбільше та найменше значення, але якщо розмір списку понад два елементи. 
Після видалення даних з кожного списку необхідно злити їх разом в один список, відсортувати його за зменшенням та повернути отриманий список як результат 
(Для прикладу вище результат буде наступним:[6, 5, 4, 3, 2]).'''


def data_preparation(list_data):
    new_list = []
    for list in list_data:
        if len(list) > 2:
            list.sort()
            list.pop(0)
            list.pop(-1)
            new_list.extend(list)
        else:
            new_list.extend(list)
    new_list.sort(reverse=True)
    return new_list


print(data_preparation([[1, 2, 3, 0], [3], [5, 6, 1, 7, 2]]))
